app/controllers/posts_controller.rb

  def edit
    @post = Post.find_by(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE (1) LIMIT 1